test/data/out/inv-op-date.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroLR.xsd" xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroInformacion.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
  <soapenv:Body>
    <sum:RegFactuSistemaFacturacion>
      <sum:Cabecera>
        <sum1:ObligadoEmision>
          <sum1:NombreRazon>Invopop S.L.</sum1:NombreRazon>
          <sum1:NIF>B85905495</sum1:NIF>
        </sum1:ObligadoEmision>
      </sum:Cabecera>
      <sum:RegistroFactura>
        <sum1:RegistroAlta>
          <sum1:IDVersion>1.0</sum1:IDVersion>
          <sum1:IDFactura>
            <sum1:IDEmisorFactura>B85905495</sum1:IDEmisorFactura>
            <sum1:NumSerieFactura>SAMPLE-004</sum1:NumSerieFactura>
            <sum1:FechaExpedicionFactura>13-11-2024</sum1:FechaExpedicionFactura>
          </sum1:IDFactura>
          <sum1:NombreRazonEmisor>Invopop S.L.</sum1:NombreRazonEmisor>
          <sum1:TipoFactura>F1</sum1:TipoFactura>
          <sum1:FechaOperacion>10-11-2024</sum1:FechaOperacion>
          <sum1:DescripcionOperacion>This is a sample invoice with a standard tax</sum1:DescripcionOperacion>
          <sum1:Destinatarios>
            <sum1:IDDestinatario>
              <sum1:NombreRazon>Sample Consumer</sum1:NombreRazon>
              <sum1:NIF>B63272603</sum1:NIF>
            </sum1:IDDestinatario>
          </sum1:Destinatarios>
          <sum1:Desglose>
            <sum1:DetalleDesglose>
              <sum1:Impuesto>01</sum1:Impuesto>
              <sum1:ClaveRegimen>01</sum1:ClaveRegimen>
              <sum1:CalificacionOperacion>S1</sum1:CalificacionOperacion>
              <sum1:TipoImpositivo>21.0</sum1:TipoImpositivo>
              <sum1:BaseImponibleOimporteNoSujeto>1800.00</sum1:BaseImponibleOimporteNoSujeto>
              <sum1:CuotaRepercutida>378.00</sum1:CuotaRepercutida>
            </sum1:DetalleDesglose>
          </sum1:Desglose>
          <sum1:CuotaTotal>378.00</sum1:CuotaTotal>
          <sum1:ImporteTotal>2178.00</sum1:ImporteTotal>
          <sum1:Encadenamiento>
            <sum1:RegistroAnterior>
              <sum1:IDEmisorFactura>B12345678</sum1:IDEmisorFactura>
              <sum1:NumSerieFactura>SAMPLE-001</sum1:NumSerieFactura>
              <sum1:FechaExpedicionFactura>26-11-2024</sum1:FechaExpedicionFactura>
              <sum1:Huella>0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF</sum1:Huella>
            </sum1:RegistroAnterior>
          </sum1:Encadenamiento>
          <sum1:SistemaInformatico>
            <sum1:NombreRazon>My Software</sum1:NombreRazon>
            <sum1:NIF>12345678A</sum1:NIF>
            <sum1:NombreSistemaInformatico>My Software</sum1:NombreSistemaInformatico>
            <sum1:IdSistemaInformatico>A1</sum1:IdSistemaInformatico>
            <sum1:Version>1.0</sum1:Version>
            <sum1:NumeroInstalacion>12345678A</sum1:NumeroInstalacion>
            <sum1:TipoUsoPosibleSoloVerifactu>S</sum1:TipoUsoPosibleSoloVerifactu>
            <sum1:TipoUsoPosibleMultiOT>S</sum1:TipoUsoPosibleMultiOT>
            <sum1:IndicadorMultiplesOT>N</sum1:IndicadorMultiplesOT>
          </sum1:SistemaInformatico>
          <sum1:FechaHoraHusoGenRegistro>2024-11-26T05:00:00+01:00</sum1:FechaHoraHusoGenRegistro>
          <sum1:TipoHuella>01</sum1:TipoHuella>
          <sum1:Huella>F5D2E033EEB82E06908BE1F7059D84F1A0DCA49FB7CC383E7F11D119FF36370F</sum1:Huella>
          <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-test-doc-id-Signature">
            <ds:SignedInfo>
              <ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"></ds:CanonicalizationMethod>
              <ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"></ds:SignatureMethod>
              <ds:Reference Id="Reference-test-doc-id" URI="">
                <ds:Transforms>
                  <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"></ds:Transform>
                </ds:Transforms>
                <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></ds:DigestMethod>
                <ds:DigestValue>zdaE3DMvg7q/TVP0Afp1KkgJSxNzhLwZ8MFnX0N6kX8=</ds:DigestValue>
              </ds:Reference>
              <ds:Reference Type="http://uri.etsi.org/01903#SignedProperties" URI="#Signature-test-doc-id-SignedProperties">
                <ds:Transforms>
                  <ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"></ds:Transform>
                </ds:Transforms>
                <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></ds:DigestMethod>
                <ds:DigestValue>3G92E0NveZL9A2c34x0rlVE3xHJs8HnJ1SN69pM10i8=</ds:DigestValue>
              </ds:Reference>
            </ds:SignedInfo>
            <ds:SignatureValue Id="Signature-test-doc-id-SignatureValue">AtbnxrdRbkH7F+ZycWlx13KVmI/iMRIAxFp+z6GLMoqFks9Eamc1xwySdYHH+3Uc+yNnEGFJdIIV2oVImgiL6NqE5nGC4p/p4R7O5vpWp78aWkNgxMjLBfD8mZ2NrKzqg3JivXPMzVMnZqqEhwEiCaBoH5JjtNnZ2JSuXrbPisWCgUP3Ahr/EQetUG5yRfCHU6JVgNzOLepphM8lsHmY3ZvDGfz1l8vnTRuwHwAgLbNVI562tZlMyesZWZmt6sh66ThvtYe1Fa0foar4ZncShi+V468gjUACGHjJ/nrkYsBOB0uzawlQ4DfEVsdlp28R65G3nHa3gjVfjRmh/22BIg==</ds:SignatureValue>
            <ds:KeyInfo Id="Certificate-test-doc-id">
              <ds:X509Data>
                <ds:X509Certificate>MIIC6TCCAdGgAwIBAgIBATANBgkqhkiG9w0BAQsFADAuMREwDwYDVQQKEwhUZXN0IE9yZzEZMBcGA1UEAxMQVGVzdCBDZXJ0aWZpY2F0ZTAeFw0yNDAxMDEwMDAwMDBaFw0zNDAxMDEwMDAwMDBaMC4xETAPBgNVBAoTCFRlc3QgT3JnMRkwFwYDVQQDExBUZXN0IENlcnRpZmljYXRlMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAs0D/mPSfSSzpiUWxvqYTLjX/IMNafVpm9/aCRiKq+Hr9MwDaXV/jkXht4gyBs4plnBnitpxKKb1JoB2GkO04hVQN46IpbnwI72MukoxpYTsC8iar1WjC40doVHAQVVpmJbAW2y38xPTNHyo+lW+386Ef+PLmhilqYGpWWU1Cpg0snmGozcPtu8tH2eeeOUjy8UNVPycqYOccAzbvclDSF2Lf3yqynRVIxQzdTpGyVw4qUgUVJi5q1tV56x2Tq2IjvIArcFqHQ7rBO9ZT1PEUKGw3bPrhVcBCFO5dFfw+qCWIIRMlWtVrmpV5OCu57/7lP9PL47FllsxxFuzUDAb0ewIDAQABoxIwEDAOBgNVHQ8BAf8EBAMCB4AwDQYJKoZIhvcNAQELBQADggEBAEnkRyRNGU/Ah6pdJ9O+hVVsqjcP3BNuoj152V6kp+yGMiOMnykIeLD9GjSXRnLy28Top2bLQfcf2jJtJB9hyJYVSvyFkw4jqi/eXAWzQhf5lTnddxaAHR8JnCsd7dp5LI65VNjyRrk3lbz4E3is+oadNIOGx0MtdvENwIN6GU9Tp7FufTHXxHuCf+6Ac/7E7RCdiltlYiYWO4laibIvgwOmimXrPHfOSmET9PfI1H49abl1eVkt75Q3kwIo4Et2iuYz3Qa4svmBt36USivnMJOW1+xGmlwVasXTScWCT2iyAWyR8GJT9afB6PoeQi96n/JMbvLmb3p2/26yzaAqbEE=</ds:X509Certificate>
              </ds:X509Data>
              <ds:KeyValue>
                <ds:RSAKeyValue>
                  <ds:Modulus>s0D/mPSfSSzpiUWxvqYTLjX/IMNafVpm9/aCRiKq+Hr9MwDaXV/jkXht4gyBs4plnBnitpxKKb1JoB2GkO04hVQN46IpbnwI72MukoxpYTsC8iar1WjC40doVHAQVVpmJbAW2y38xPTNHyo+lW+386Ef+PLmhilqYGpWWU1Cpg0snmGozcPtu8tH2eeeOUjy8UNVPycqYOccAzbvclDSF2Lf3yqynRVIxQzdTpGyVw4qUgUVJi5q1tV56x2Tq2IjvIArcFqHQ7rBO9ZT1PEUKGw3bPrhVcBCFO5dFfw+qCWIIRMlWtVrmpV5OCu57/7lP9PL47FllsxxFuzUDAb0ew==</ds:Modulus>
                  <ds:Exponent>AQAB</ds:Exponent>
                </ds:RSAKeyValue>
              </ds:KeyValue>
            </ds:KeyInfo>
            <ds:Object>
              <xades:QualifyingProperties xmlns:xades="http://uri.etsi.org/01903/v1.3.2#" Id="Signature-test-doc-id-QualifyingProperties" Target="#Signature-test-doc-id-Signature">
                <xades:SignedProperties Id="Signature-test-doc-id-SignedProperties">
                  <xades:SignedSignatureProperties>
                    <xades:SigningTime>2024-11-26T04:00:00+00:00</xades:SigningTime>
                    <xades:SigningCertificate>
                      <xades:Cert>
                        <xades:CertDigest>
                          <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></ds:DigestMethod>
                          <ds:DigestValue>ewsstiGgTfzBoBGrpinBPSrSMvV+sW//gV0WIZdqLY4=</ds:DigestValue>
                        </xades:CertDigest>
                        <xades:IssuerSerial>
                          <ds:X509IssuerName>CN=Test Certificate,O=Test Org</ds:X509IssuerName>
                          <ds:X509SerialNumber>1</ds:X509SerialNumber>
                        </xades:IssuerSerial>
                      </xades:Cert>
                    </xades:SigningCertificate>
                    <xades:SignaturePolicyIdentifier>
                      <xades:SignaturePolicyId>
                        <xades:SigPolicyId>
                          <xades:Identifier>urn:oid:2.16.724.1.3.1.1.2.1.9</xades:Identifier>
                        </xades:SigPolicyId>
                        <xades:SigPolicyHash>
                          <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
                          <ds:DigestValue>G7roucf600+f03r/o0bAOQ6WAs0=</ds:DigestValue>
                        </xades:SigPolicyHash>
                        <xades:SigPolicyQualifiers>
                          <xades:SigPolicyQualifier>
                            <xades:SPURI>https://sede.administracion.gob.es/politica_de_firma_anexo_1.pdf</xades:SPURI>
                          </xades:SigPolicyQualifier>
                        </xades:SigPolicyQualifiers>
                      </xades:SignaturePolicyId>
                    </xades:SignaturePolicyIdentifier>
                  </xades:SignedSignatureProperties>
                  <xades:SignedDataObjectProperties>
                    <xades:DataObjectFormat ObjectReference="#Reference-test-doc-id">
                      <xades:ObjectIdentifier>
                        <xades:Identifier>urn:oid:1.2.840.10003.5.109.10</xades:Identifier>
                      </xades:ObjectIdentifier>
                      <xades:MimeType>text/xml</xades:MimeType>
                      <xades:Encoding>UTF-8</xades:Encoding>
                    </xades:DataObjectFormat>
                  </xades:SignedDataObjectProperties>
                </xades:SignedProperties>
              </xades:QualifyingProperties>
            </ds:Object>
          </ds:Signature>
        </sum1:RegistroAlta>
      </sum:RegistroFactura>
    </sum:RegFactuSistemaFacturacion>
  </soapenv:Body>
</soapenv:Envelope>